{
  "id": "huttohuthikingslovenia.com_tours_the-best-julian-alps-and-soca-valley-hike__chunk_2",
  "title": "The Best Julian Alps and Soča Valley Hike - Part 2",
  "content": "Day 1: Mountain Pastures above Bohinj\n\nWe will start the day by picking you up, and driving to Bohinj where we’ll start our hike. The first day of hiking will see us ascend the most so we can reach the mountains. As an easier option, we offer a shuttle to a higher starting point at Planina Blato. We will\n\nwalk through high mountain pastures\n\n, and see the shepherds’ cottages where they have been producing cheese for centuries, with some still continuing this tradition. We will hike up to the\n\nTriglav lakes mountain hut\n\nby the beautiful\n\nDouble lake\n\n, eat an authentic Slovenian dinner, and get some rest.\n\nHiking\n\n14 km (8,7 mi), 1250 vertical meters up (4100 feet), 100 meters down (330 feet)\n\nAccommodation\n\nKoča pri Triglavskih Jezerih\n\n×\n\nDay 2: The Seven Lakes Valley\n\nOn the second day, we will head along the amazing\n\nTriglav Lakes Valley, and see its mesmerizing glacial lakes\n\n. Even though we’ll spend the day walking through the valley, the views of surrounding high peaks will still give us\n\nan amazing Alpine experience\n\n. We will stop at the Zasavska Lodge at Prehodavci to get something to eat and regain our strength. Then we will descend further down, into the\n\nTrenta valley\n\nand spend the night there.\n\nHiking\n\n14 km (8,7 mi), 350 vertical meters up (1150 feet), 1450 meters down (4800 feet)\n\nAccommodation\n\nApartment in Trenta\n\n×\n\nDay 3: Alpe Adria Trail\n\nWe will hike along\n\nthe most beautiful European river\n\n, and the jewel of Slovenia – the\n\nSoča river\n\n. Apart from the emerald green depths of the Soča and its thrilling river rapids, we will also be able to admire the traditional architecture of the Trenta Valley. We will cross footbridges above Soča’s troughs and gorges. Those brave enough can even jump in the freezing cold water. This is\n\nan easy day of hiking, as we will mostly tackle flat terrain\n\n. Depending on our agreement,\n\nwe can even reduce the amount of walking\n\n, and have a shuttle ride take us to\n\nLepena\n\n, where we will spend the night.\n\nHiking\n\n16 km (10 mi), 450 vertical meters up (1500 feet), 350 meters down (1150 feet)\n\nAccommodation\n\nDom Klementa Juga v Lepeni\n\n×\n\nDay 4: Hike to Komna Plateau\n\nWith our batteries recharged, we will tackle steeper terrain once more. We will hike up to the\n\ncrystal clear Lake Krn\n\n, and stop at the mountain hut there, to get something to eat. Our trail will lead us into\n\nthe heart of the Komna Plateau\n\n, an area full of\n\nWWI remnants\n\n. This is also where the coldest ever temperature in Slovenia was recorded!\n\nHiking\n\n14 km (8,7 mi), 1300 vertical meters up (4300 feet), 500 meters down (1650 feet)\n\nAccommodation\n\nDom na Komni\n\n×\n\nDay 5: Descend back to Bohinj\n\nWe will end our tour by\n\ndescending to Lake Bohinj\n\n. On the way, we will see the famous\n\nSavica waterfall\n\n, which is also the spring of the Sava Bohinjka River. We will continue our hike with a\n\nwalk along the north shores of Lake Bohinj\n\n, which will give us a great opportunity to jump in and go for a rejuvenating swim.\n\nHiking\n\n15 km (9,3 mi), 100 vertical meters up (330 feet), 1000 meters down (3300 feet)\n\n×"
}