{
  "id": "huttohuthikingslovenia.com_triglav-national-park-tours__chunk_3",
  "title": "Triglav National Park Tours - Part 3",
  "content": "Because of its high altitude, it is also an excellent starting point for\neasy hikes to high mountains\n, like the\nhike to Viševnik\n, with an up-close view to Triglav.\nMojstrana and the Triglav Alpine Valleys\nFrom Bled, go past the\nVintgar gorge\nand through the\nRadovna valley and Lake Kreda\nto arrive in the small alpine village of\nMojstrana\n. The village’s history has always been closely connected with the mountains surrounding it, as priest\nJakob Aljaž\nhere bought the land on top of Triglav, built the turret and kept the peak Slovenian, in a time where there the mountains here were under a lot of German influence. If you’re a fan of history and mountains, you’re going to love the\nSlovenian Alpine Museum\nsituated in the village.\nMojstrana is situated right at the beginning of the three\nTriglav Alpine valleys – Vrata, Krma and Kot\n. Both Vrata and Krma can be reached by car and are a paradise for any outdoor enthusiast, regardless of how much energy they would like to spend. In Krma, you can enjoy a walk past green meadows, surrounded by steeply-rising surrounding mountains and enjoy an authentic meal in the Kovinarska hut at the end.\nThe Vrata valley offers even more beautiful sights, the first of these being the 52 metres high\nPeričnik waterfall\n, behind which you can even walk! If you continue up the valley along the Triglavska Bistrica river, you’ll arrive at the\nAljaž hut\nfrom where you can stare in awe at the mighty\nTriglav north face\n, rising 1200 metres from the valley, ending in the highest peak of the country.\nVrata valley\nUpper Sava Valley and Kranjska Gora\nIf you continue down the main road along the Sava Dolinka river, you will soon arrive in Gozd Martuljek for\none of the more magnificent views of the Julian Alps\nfrom the valley. The panorama is characterized by the sharp peak of Špik with its neighbours and is a must-stop for some photos.\nIf you’re also up for a short hike, walk for half an hour to reach the\nLower Martuljek Waterfall\n. For an even better view of the Martuljek mountain chain, hike\npast the Jerman waterfall to Srednji Vrh village\n.\nJust a short drive ahead you will reach\nKranjska Gora\n, the all-year-round hotspot for outdoor activities, especially winter skiing. From there you can go to the\nZelenci Nature Reserve\nand walk on the wooden footpath to the viewing platform above the emerald spring lake surrounded by mountains. You can also visit the\nPlanica Nordic Centre\nwith the once biggest ski flying hill in the world. Optionally, hike from Planica between the grey peaks in the\nTamar Valley\nto the authentic hut for a meal.\nOn your drive south from Kranjska Gora, stop by at\nLake Jasna\nand replenish yourselves with a drink and a view of the Julian Alps reflecting in the lake. From the lake, follow the river Velika Pišnica and hike to the end of the\nKrnica Valley\n, surrounded by the 2400 metre high peaks all around.\nOn the western side of the valley lies the scenic Russian road to the Vršič pass, with its 1611 metres the highest pass in the Eastern Julian Alps. On its 50 hairpin bends (“serpentine” in Slovene), you can see the wooden\nRussian Chapel\n, built in 1917 in memory of the Russian prisoners of war who died during its construction. Higher up, keep an eye open for the\nface in the cliffs – the Heathen Maiden\n, and the\nnatural window in the Prisank north face\n.\nThe Valley of the Soča River\nAfter you descend the “serpentine” from the Vršič pass, you reach the valley of the 138-kilometre\nSoča River\n, the beautiful emerald river of western Slovenia. Just at the second to last hairpin turn, you can turn off for the short but difficult hike to the\nsource of the Soča river\n. The river first streams through the\nTrenta Valley\nsettled with charming settlements with traditional homesteads of wood and stone.\nContinue driving along the river and stop by to rest by the emerald green pools of the\nSoča Gorge\n. Turn right at the\nGreat Soča Gorge\nand continue into the pristine\nLepena Valley\nwith the Lepenjca stream. For the most relaxing experience there, visit the\nŠunik Water Grove\nand take a moment to the melody of water running over moss-covered rocks.\nSoča valley is also home to many water sports\n. For a more adventurous day, try out some of the more wild\nactivities on the Soča river\nlike rafting, kayaking or canyoning.\nKayaking fun on Soča River\nMake the most of your trip\nVisiting all of these attractions would mean more than 250 kilometres of driving, never mind the relaxing, hiking and walking, which are probably the more desirable part of your trip. That’s why we recommend you\nsplit your exploration of the Triglav National Park into multiple days\n.\nTo make the most of your trip, it’s best to split them off into areas as described above. For a great day trip, you can combine the Triglav Valleys, Upper Sava Valley and the sights around Kranjska Gora into a one-day\nTriglav National Park Tour from Ljubljana\n.\nTo shorten your drive back from the furthermost region of the Soča Valley and make it a circular trip, you can\nboard a motorail train\nin Most na Soči that will take you under the Julian Alps through the longest tunnel in Slovenia to Bohinjska Bistrica. What’s even better is that on the way to the train, you can also visit the alpine towns of\nBovec, Kobarid and Tolmin\n.\nFor an alternative to the above, drive through the idyllic alpine village of Log pod Mangartom and across the\nPredil pass\nto Italy. Stop by the beautiful\nPredil Lake\n(“Lago del Predil” in Italian), drive through Tarvisio and rest by the beautiful\nFusine Lakes\nwith the view of the third highest mountain in Slovenia, Mount Mangart, in the background. After that, just drive back across the border to Slovenia and you’re right back in Kranjska Gora.\nCycling Tours\nMost of the sights described above can be easily reached by bike\n, which you can either transport with your car or rent in your starting town. As for a few exceptions, there aren’t any steep climbs on our ride to reach the most beautiful parts of the Park.\nYour cycling tour can get even better where there is a bike track separate from the road. The most beautiful example of this is a\nbike tour from Mojstrana to Zelenci Nature Reserve\n, accompanied by the constant views of the Julian Alps when riding through the Upper Sava Valley.\nFor a few days of riding around the Park, a\ncycling holiday around the Bled area\nis also a great choice. With an electric mountain bike, you can\ndiscover the vast forests of Pokljuka and Jelovica plateaus\nwith their hidden alpine pastures and peaceful gravel roads.\nThose looking for more of a challenge are also in the right place. With its 800 of elevation gain,\nVršič pass is a must-do for every road-cycling enthusiast\n."
}