{
  "id": "huttohuthikingslovenia.com_guides__chunk_1",
  "title": "Our Hiking Guides - Part 1",
  "content": "\n\nUroš is our go-to guide for the most demanding tours. He is an expert climber and mountaineer, with over 10 years of experience in alpinism on the highest level. He is also head of the climbing section and alpine climbing school of Slovenia’s largest mountaineering club and has always had a passion for working with people and sharing his knowledge and skills with clients. Slovenian mountains are where his home is and he will be more than happy to share a piece of his world with you, be it on the easy paths above Bohinj, snowy ski touring tracks, via-ferrata routes, or unmarked paths of Julian Alps.\n\n\n\nTrailrunner, mountaineer, and ski mountaineer, born in the heart of Slovenian highest mountains. After finishing my career as a road cyclist, I got the chance to fully commit to the mountains and sports connected to them. I am a professional mountain athlete, member of the Slovenian national team in ski-mountaineering and trail running, and I’m also competing in extreme mountain races on the international level.\nHigh Slovenian mountains are my favorite playground, where I test my limits on a daily basis. On the other hand, I have a big passion to show these epic mountains to others and show them why I love those trails so much.\n\n\n\nBine is the kind of person to make even the hardest climb feel easy with his positive energy. His immersive knowledge about the local mountains and culture will keep you entertained through the tours and his teaching skills will prove infallible when challenging yourself in the mountains. His adventurous spirit was honed in the Slovenian Alps, where you can find him during the summer. “I write Alps with a capital A”, he always tells his friends. “They’re my habitat and my strength; I love them for their pale limestone, their sharp peaks and their purity.” Bine is also a professional ski mountaineer, winning the National Slopestyle Championship seven times and guiding freeride and ski mountaineering tours in Chamonix.\n\n\n\nBorn near Lake Bled I was introduced to the Julian Alps as a child and would go hiking with my father who taught me about the flora and fauna in the region. Growing up in the Alpine region I got to know cultural traditions and legends which go a few centuries back in history. I started to work in Tourism ten years ago as a high rope course instructor and over the years have gained professional knowledge through courses for international mountain guiding, canyoning, and snowboarding/ski coaching. I have experienced the mountains in many ways and I’m very passionate about sharing the stories of Slovenian culture, traditional food, and my own experiences in nature.\n\nAbout our Hut to Hut Guides\nWe know that a hut to hut tour can be more than just an opportunity to see the natural wonders. A good guide can bring it to the next level, so you will remember it for years to come. That is our goal.\nEven though Slovenian mountains are quite popular, they still require some level of experience with mountain hiking. From choosing the appropriate route and researching accommodation availability, to recommending the right equipment and adapting to weather conditions – these are just a few of the things a mountain guide can offer you. Compared to climbing challenging peaks, in hut-to-hut hiking, a guide will take care of all the logistics and route-finding, which is hard to do without knowing these mountains inside out, as our Triglav National Park guides do.\nStill, the unpredictable nature of mountains should not be underestimated. Hut-to-hut hikes largely skip the most challenging routes, but mountains are often unpredictable, which means you always have to be able to adapt to different conditions. Expert guides are trained exactly for that – How to respond to any situation that might occur on your tour.\nAs the guides at Hut to Hut Hiking Slovenia, we are passionate and experienced hiking enthusiasts who work in the outdoor industry year-round and are dedicated to giving you an exceptional experience. We are not only taking care of your safety but are also great travelling companions, always willing to share an interesting adventure story or all the knowledge we have about the local terrain, culture, food and customs.\nAll of us uphold the highest standards of safety and professionalism to our clients since we all have mountain leadership certifications and forever continue honing our skills through advanced guiding and leadership courses.\nThe UIMLA International Mountain Leader and the IFMGA Mountain Guide are the only internationally recognised qualifications for those leading groups in the mountains. Those who earned the honour of carrying either of these two certifications have completed many years of training to make your hut-to-hut hiking experience as enjoyable as possible.\n\nWe know that a hut to hut tour can be more than just an opportunity to see the natural wonders. A good guide can bring it to the next level, so you will remember it for years to come. That is our goal.\nEven though Slovenian mountains are quite popular, they still require some level of experience with mountain hiking. From choosing the appropriate route and researching accommodation availability, to recommending the right equipment and adapting to weather conditions – these are just a few of the things a mountain guide can offer you. Compared to climbing challenging peaks, in hut-to-hut hiking, a guide will take care of all the logistics and route-finding, which is hard to do without knowing these mountains inside out, as our Triglav National Park guides do.\nStill, the unpredictable nature of mountains should not be underestimated. Hut-to-hut hikes largely skip the most challenging routes, but mountains are often unpredictable, which means you always have to be able to adapt to different conditions. Expert guides are trained exactly for that – How to respond to any situation that might occur on your tour.\nAs the guides at Hut to Hut Hiking Slovenia, we are passionate and experienced hiking enthusiasts who work in the outdoor industry year-round and are dedicated to giving you an exceptional experience. We are not only taking care of your safety but are also great travelling companions, always willing to share an interesting adventure story or all the knowledge we have about the local terrain, culture, food and customs.\nAll of us uphold the highest standards of safety and professionalism to our clients since we all have mountain leadership certifications and forever continue honing our skills through advanced guiding and leadership courses.\nThe UIMLA International Mountain Leader and the IFMGA Mountain Guide are the only internationally recognised qualifications for those leading groups in the mountains. Those who earned the honour of carrying either of these two certifications have completed many years of training to make your hut-to-hut hiking experience as enjoyable as possible."
}