{
  "id": "huttohuthikingslovenia.com_mountain-huts_aljazev-dom-v-vratih__chunk_2",
  "title": "Aljažev dom v Vratih - Part 2",
  "content": "Access\nBy road from Mojstrana (walking time 2.5h)\nInteresting tours\nBovški Gamsovec: 4.5h\nStenar: 5h\nTriglav: 6h\nŠkrlatica: 6h\n\n×\n\nThings to know\nWhat does fitness and technical difficulty mean?\nWe have rated our tours on a scale from 1 to 5. 1 being the easiest and 5 being the most difficult.\nFitness level difficulty tells you about how fit you need to be for a tour and how much walking there is. Most of our tours are suitable for most people that are regularly active and can walk for around 5-6 hours per day with breaks.\nTechnical difficulty tells us about the paths we use – Level 1 means that zero hiking experience is required, while 5 is only for experienced hikers used to the exposure and basic climbing techniques.\nWho will be our guide?\nOur guided tours are led by UIMLA or IMFGA internationally licensed guides who have completed many years of training to make your hut to hut hike both safe and enjoyable. They are passionate individuals who call the Slovenian mountains their second home and are ready to share this adventure with you.\nCan I get a private room?\nDifferent huts have different options and sometimes, private rooms for 2 or 4 persons are available. It is not the rule and they require a very early booking. We will try to get you the best possible accommodation from what is available at the time of your booking.\nHow much in advance should I book?\nWe recommend booking as early as possible. Slovenian mountain huts are very popular and get booked up several weeks in advance, especially on weekends. If your booking is late, we will try our best to find a suitable alternative. Sometimes, last-minute spots open up. However, we cannot guarantee a free spot.\nDo I need a sleeping bag?\nNo, all of the huts provide blankets, bedding and pillows, but you can bring your own silk or cotton sleeping liner.\nI have food restrictions\nAll of the huts offer vegetarian options and usually at least one vegan option. Still, kitchens high up are basic, so don’t expect too many choices. Huts generally serve authentic meals like stews, soups, and sausages. If you have strict dietary restrictions, consider bringing your own food as they can’t make a special meal per request.\nHow about water?\nMost high-altitude huts in Slovenia don’t have a drinking water source, but you can buy bottled water for around 4,5€ per 1,5l. You can also bring a water purifier and filter rainwater or water from the lakes. There are also some freshwater sources on the way so you never have to carry too much.\nHow do I pay for the huts?\nIn our guided tours, we take care of the reservations for you, and you pay for the huts together with food on the spot.  In most huts, you can pay with a credit card, but it is advisable to bring some cash just in case if the internet is down – After all, you’re in the mountains. If you are a member of the UIAA Alpine Association, bring your card and you will get a discount.\nFor our self-guided tours, the accommodation with breakfast is included in the price.\nHow good is the cell reception in the mountains? Is there wifi available?\nCell reception is on and off in most parts of the Julian Alps. The reception is generally better on the peaks and exposed parts and worse in secluded valleys. Some huts offer paid wifi option, but not all.\nAre the tours only possible in summer?\nMost of the mountain huts only operate from June to September. Some huts are open sooner and longer, but those times change from season to season according to weather and snow conditions.\nRead about best seasons for hiking in Slovenia.\nIf conditions are favourable we can make a\ncustom tour\neven before June or after September.\nWhat if the weather forecast is bad?\nMost of the tours can be done even in light rain, as long as you dress accordingly. It is not unusual in the summer that there are afternoon thunderstorms, so early starts are advisable. If the weather looks really bad, we will try to reschedule or propose an alternative tour.\nWhat to bring for an overnight stay in the mountain hut?\nTry to pack light, only take what you really need. You need your passport or ID for check-in, and some cash is advisable if the internet is down. Bring your sleeping liner and earplugs for the night, and toothbrush and body wipes for hygiene. You don’t need slippers, they are in the hut already.\nShow more\nShow less\n\nWe have rated our tours on a scale from 1 to 5. 1 being the easiest and 5 being the most difficult.\nFitness level difficulty tells you about how fit you need to be for a tour and how much walking there is. Most of our tours are suitable for most people that are regularly active and can walk for around 5-6 hours per day with breaks.\nTechnical difficulty tells us about the paths we use – Level 1 means that zero hiking experience is required, while 5 is only for experienced hikers used to the exposure and basic climbing techniques.\n\nOur guided tours are led by UIMLA or IMFGA internationally licensed guides who have completed many years of training to make your hut to hut hike both safe and enjoyable. They are passionate individuals who call the Slovenian mountains their second home and are ready to share this adventure with you.\n\nDifferent huts have different options and sometimes, private rooms for 2 or 4 persons are available. It is not the rule and they require a very early booking. We will try to get you the best possible accommodation from what is available at the time of your booking.\n\nWe recommend booking as early as possible. Slovenian mountain huts are very popular and get booked up several weeks in advance, especially on weekends. If your booking is late, we will try our best to find a suitable alternative. Sometimes, last-minute spots open up. However, we cannot guarantee a free spot.\n\nNo, all of the huts provide blankets, bedding and pillows, but you can bring your own silk or cotton sleeping liner.\n\nAll of the huts offer vegetarian options and usually at least one vegan option. Still, kitchens high up are basic, so don’t expect too many choices. Huts generally serve authentic meals like stews, soups, and sausages. If you have strict dietary restrictions, consider bringing your own food as they can’t make a special meal per request.\n\nMost high-altitude huts in Slovenia don’t have a drinking water source, but you can buy bottled water for around 4,5€ per 1,5l. You can also bring a water purifier and filter rainwater or water from the lakes. There are also some freshwater sources on the way so you never have to carry too much."
}