{
  "id": "huttohuthikingslovenia.com_about-us__chunk_1",
  "title": "About Us - Part 1",
  "content": "Guided tours to the Slovenian Alps, exploring Triglav National Park and more through diverse and picturesque hiking trails.\n\nHello fellow hiker! My name is Klemen, and I’m the manager of Hut to Hut Hiking Slovenia.\nI first discovered my love for mountains as a teenager, when I started mountain biking and skiing. I was hooked from the beginning: the feeling of flying downhill on a bike or carving loops down steep slopes while surrounded by magnificent mountain scenery never got boring.\nBut the mountains were calling me to go higher and on more demanding trails.\nSoon, my bike could not accompany me anymore. I started hiking, later on climbing and becoming an alpinist. I explored almost every corner of the Slovenian mountains, standing on the most important peaks in all of our mountain ranges.\nOne of the most fun aspects of hiking for me is definitely planning. I am always looking for my next destination when in the mountains and then studying maps when I am home. The more I knew about the Slovenian mountains, the more diverse adventures opened up for me.\nWithout that knowledge and experience, you only see a little of what is possible in the Slovenian Alps. You’re limited to the most popular and usually quite crowded routes and miss all the hidden and sometimes even more mesmerizing areas.\nIt is truly amazing to realize how much better a hiking tour in Slovenia can be if you know what you’re doing.\nHiking in Pokljuka Plateau\nMost people that I meet visiting Slovenia from abroad have this problem. They have a hunch that there should be more, but they only know about a few places where they could potentially go hiking here.\nThat’s why Hut to Hut Hiking Slovenia was born. With it, I wanted to help any visitors in Slovenia find their way in our mountains and experience an adventure usually reserved only for the very experienced locals.\nAs its name implies, it’s all about hiking in Slovenia — but not just any hikes. It’s about picking your own huts along the way — mountain huts that shelter you from bad weather and a place to eat some food before heading back onto the trail — and then making your own custom tour by linking them up in any order you want!\nSlovenia is an excellent hiking destination\nWhen it comes to recommending where to spend your hiking vacations, Slovenia would definitely be my number one pick. I might be a little biased, but hear me out.\nI’ve hiked and climbed in mountains abroad, and I constantly return back, finding new challenges or seeing old routes in a new way.\nSlovenia has three alpine ranges\n, each one of them with its own unique spirit. You can explore the massive peaks of the Julian Alps, hike on the sharp ridges of the Karawanks, or explore the hidden beauty of the Kamnik-Savinja Alps.\nHiking to Kriški Podi Lodge\nSlovenia is known for its long hiking tradition. Whatever mountains you set your sights on, you’ll definitely meet some local hikers there. That’s why we also have great hiking infrastructure: With an area of 20,273km², Slovenia has\nover 10,000km of marked trails\nof all difficulties — giving it one of the densest networks of hiking trails in Europe.\nAnd conveniently placed on these trails are\nmany mountain huts\n, which offer every hiker a shelter and a place to sleep. And what I admire the most about them is their authentic vibe, in which you can meet both locals and foreigners and together admire the natural beauty surrounding you while eating a warm home-made meal.\nAnd beautiful it is. White limestone peaks, sharp ridges, pristine high-altitude lakes, crystal-clear streams — all of it can be admired while hiking in the\nTriglav National Park\nor anywhere else in the Slovene mountains. Everyone that decides to come here on a hut to hut hike is in for a treat.\nEnthusiastic Team of Mountain Professionals\nAnd it’s not just me. We’re a company full of\nmountain enthusiasts\nand\nprofessional guides\nwhose primary focus is on providing a great experience — it’s not just a job, it’s an opportunity to share our passion with others and make them feel at home in the Slovenian wilderness.\nThe happy faces of our clients give us constant motivation and inspiration to continue on our mission. Our goal is to make Hut to Hut Hiking Slovenia the leading provider of guided and self-guided multi-day hiking tours in Slovenia.\nAnd the only way we can do it is by being the best at what we do — organizing exceptional\nhut to hut tours\nthat will give a lasting impression on every one of our clients.\nView over Soča valley\nI believe everyone should have a chance to experience the adventure that is hut-to-hut hiking in Slovenia. I invite you to join us in exploring this diverse mountainous environment and watching sunrises and sunsets come and go while slowly dozing off to sleep in the cozy mountain huts.\nLand of unlimited possibilities\nWhile reading the last few paragraphs it may seem Slovenia is just mountains and valleys, but there is lots more. If you want help discovering the other attractions of the country, see what our trusted partners under\nSlovenia Discovery\nhave to offer.\nEngage in various outdoor activities, visit landmarks and taste the local cuisine with\nSlovenia Activities\n, or combine the leisurely and the active with\nSlovenia Holidays\n. If you are seeking more technical mountains, visit\nTriglav Tours\n. If you are a cyclist, you will love\nSlovenia Cycling Holidays\nand if you prefer walking, check out\nWalking Holidays Slovenia\n.\nFurthermore, if you have\nanother European hiking destination\nin mind, there are a handful of countries and areas you can discover with one of our sister brands:\nTours du Mont Blanc\nHut to Hut Hiking Switzerland\nHut to Hut Hiking Austria\nHut to Hut Hiking Dolomites\nCamino de Santiago Tours\nNorway Hut to Hut Hiking\nPyrenees Hut to Hut Hiking\nIceland Hut to Hut Hiking\nAs well as destinations around the world:\nHut to Hut Hiking Patagonia\nHut to Hut Hiking USA\nBase Camp Trek Everest\nBase Camp Trek Annapurna\nCircuit Trek Manaslu\nGokyo Lakes Trek\nHowever, if you want a\nbroader selection of hiking tours around the globe\nwithout limiting yourself to one destination, you can explore every corner of the world with us at\nHiking Tours\n.\nOur Tours"
}