{
  "id": "huttohuthikingslovenia.com_tours_triglav-ski-touring-traverse__chunk_2",
  "title": "Triglav Ski Touring Traverse - Part 2",
  "content": "Day 1: From Vogel to Komna\n\nThe first day will start at the magnificent Lake Bohinj, where the\n\ncablecar will lift us\n\nto the Vogel Ski Resort and save us a big first-day climb. After that, we’ll put on our skis and hike to Šija, the highest point of the only ski resort in the Triglav National Park. Some excellent skiing follows, which takes us to Zadnji Vogel, from where there’ll be plenty of options that will depend on the conditions. We’ll continue our journey on the\n\nup and down route to Komna\n\n, the mountain karst plateau, where the Komna hut, our resting place for the night, awaits us.\n\nHiking\n\n17 km (10,5 mi), 600 vertical meters up (2000 feet), 950 meters down (3200 feet)\n\nAccommodation\n\nDom na Komni\n\n×\n\nDay 2: Through the Seven Lakes Valley\n\nOn the second day, you will slowly continue your way across the Komna plateau to the Double lake and the\n\nTriglav Lakes Hut\n\n. There, one of the more picturesque parts of the tour follows, the ascent through the stunning\n\nTriglav Lakes Valley\n\nbesides the frozen lakes and the magnificent peaks towering over them. The day will end at Prehodavci, where the panoramic view to the western part of the Julian Alps will open up. Because the hut there is closed, we will have to get more adventurous and sleep in\n\nthe authentic bivouac\n\n. It is well isolated, but not heated, which means we’ll have to use our sleeping bags.\n\nHiking\n\n21 km (13 mi), 1000 vertical meters up (3300 feet), 700 meters down (2300 feet)\n\nAccommodation\n\nBivouac at Prehodavci\n\n×\n\nDay 3: From Prehodavci to Krma\n\nNext morning we will ascend to the Hribarice saddle, where there will be an option to also reach the peak of Kanjavec, with\n\nstunning views all around\n\n, especially on Triglav. After that, it’s all downhill on the excellent skiing terrain down to Velska Dolina. A few hundred metres of ascent from Velo Polje to the Bohinjska Vratca pass, and we’ll be skiing down to our end destination of the\n\nglacial Krma Valley.\n\nHiking\n\n26 km (16,1 mi), 750 vertical meters up (2500 feet), 1900 meters down (6250 feet)\n\n×\n\n(Optional) Day 4: Triglav climb\n\nAs a perfect last day, the Triglav ski traverse can extend by one day with a\n\nclimb to the top of Triglav\n\n. It is meant\n\nfor the more experienced hikers\n\n, as it is done on foot. When we arrive at Bohinjska Vratca on the third day, we continue to Triglavski Dom on Kredarica, the hut with the highest elevation in Slovenia. After a night there, you have two options – Get your crampons and ice-axes ready to climb to the top of Triglav on foot, or skip that, and enjoy a long ski down past Stanič hut and valley Za Cmirom to the Vrata valley, or from Kredarica straight to the valley of Krma.\n\nHiking\n\n26 km (16,1 mi), 1400 vertical meters up (4600 feet), 2200 meters down (7250 feet)\n\n×"
}