{
  "id": "huttohuthikingslovenia.com_tours_seven-lakes-valley-hut-to-hut-hike__chunk_2",
  "title": "Seven Lakes Valley Hut to Hut Hike - Part 2",
  "content": "Day 1: Mountain Pastures above Bohinj\n\nDepending on the specifics of your tour we will pick you up at your location or meet in Bohinj. After parking, we will walk along the\n\nincredibly picturesque Voje Valley\n\n. We will follow the steep gorge of the pristine river Mostnica, and see its fascinating rock formations. After crossing a beautiful pasture, we will reach the Voje waterfall.\n\nSoon after, the path will begin to climb upwards across several smaller\n\nhigh mountain pastures\n\n, which will lead us to the\n\nVodnik Lodge\n\n. Upon arrival, we will enjoy a well-deserved dinner and head to bed.\n\nHiking\n\n11 km (6,8 mi), 1300 vertical meters up (4250 feet), 100 m (330 feet) down\n\nAccommodation\n\nVodnikov Dom\n\n×\n\nDay 2: The Seven Lakes Valley\n\nOn day two, our path will lead us along the\n\nVelska dolina valley under the southern slopes of Triglav up to the Dolič mountain hut\n\n, for our first taste of the high mountain range. At Dolič, we will cross the mountain pass and reach an altitude where vegetation no longer grows. If we preserve enough of our strength and enthusiasm,\n\nwe can extend our route here and climb the peak of Mount Kanjavec\n\n.\n\nWe will descend to the Zasavje Lodge on Prehodavci on the other side of the mountain, and recuperate our strengths with some good food while enjoying the gorgeous view of the Soča Valley. Our last mission for the day is to\n\nwalk down the famous Seven Lakes Valley\n\nand reach the Triglav Lake Lodge where we will spend the night.\n\nHiking\n\n11 km (6,8 mi), 600 vertical meters up (2000 feet), 730 meters down (2400 feet)\n\nAccommodation\n\nKoča pri Triglavskih Jezerih\n\n×\n\nDay 3: Descend back to Bohinj\n\nIf our energy levels allow it, we will start the day by tackling the steep hillside to Mala Tičarica. If we feel like taking it a bit easier, we will just pass it across the slightly up and down terrain to reach the Ovčarija mountain pasture, and then the Dedno polje mountain pasture. Here we will have the option to pay a visit to a\n\nlocal cheese-maker, who still produces cheese the traditional way up on the pasture\n\n.\n\nAfterward, we can grab a bite to eat at the mountain hut on Planina pri jezeru. We will then head through the woods to the starting point of our hike. Depending on your wishes we can spend a relaxing afternoon in Bohinj, potentially even go for a swim in the lake, before dropping you off at your hotel.\n\nHiking\n\n13 km (8 mi), 100 vertical meters up (330 feet), 1200 meters down (4000 feet)\n\n×"
}