{
  "id": "huttohuthikingslovenia.com_tours_juliana-alpe-adria-trail-highlights__chunk_2",
  "title": "Juliana & Alpe Adria Trail Highlights - Part 2",
  "content": "Day 1: Arrival in Kranjska Gora\n\nYour journey begins in the magical town of Kranjska Gora, an all-year-round sports hub. Nestled in the valley of the\n\nSava Dolinka River\n\namidst the towering peaks of the\n\nJulian Alps\n\n, it’s the perfect place to start your hike through the Slovenian Alps. After getting checked in at your hotel, you’re welcome to explore the charming streets of this\n\nAlpine town\n\nand get ready to start your adventure the following day. Have dinner at one of the local restaurants and enjoy a restful night in a valley between the Julian Alps and the\n\nKarawanks\n\n.\n\nAccommodation\n\nHotel in Kranjska Gora\n\n×\n\nDay 2: Kranjska Gora - Vršič Pass\n\nYou’ll start your day by heading toward\n\nLake Jasna\n\nand enjoying the panorama of the first sunlight hitting the peak of Mt. Prisojnik. Passing the lake, you’ll follow the path beside the\n\nPišnica stream\n\nin the direction of\n\nKrnica Valley\n\n. That’s where you’ll start climbing towards\n\nVršič Pass\n\n, one of Slovenia’s most famous alpine attractions, connecting the\n\nSava and Soča valleys\n\non the opposite sides of the Julian Alps. The path weaves through the shade of the forested slopes, passing the\n\nRussian Chapel\n\nbefore reaching the\n\nErjavčeva mountain hut\n\n, your accommodation for the night just below the top of the pass.\n\nHiking\n\n11 km and 780 m of elevation gain / 80 m of elevation loss\n\nAccommodation\n\nErjavčeva mountain hut\n\n×\n\nDay 3: Vršič Pass - Bovec\n\nIn the early morning, you can ascend to the top of the pass and enjoy the views to each side. Then, you’ll catch the\n\nbus to Bovec\n\n. You can get off the bus at any stop in the Soča Valley, from where you’ll follow the\n\nSoča Trail\n\n. The later you decide to leave the bus, the less distance you’ll have to cover to Bovec. You’ll pass the\n\nSmall and Great Soča Gorge\n\n, cross wooden bridges over the river, and follow scenic forest paths before emerging into the fields where the\n\nKoritnica River\n\nflows into Soča. Now, you’re only a short way from Bovec, where you’ll check into your hotel.\n\nHiking\n\n13.3 km and 200 m of elevation gain / 230 m of elevation loss\n\nAccommodation\n\nHotel or B&B in Bovec\n\n×\n\nDay 4: Bovec - Kobarid\n\nToday, you’ll keep following the Soča River as it flows south. Soon after leaving Bovec, you’ll pass by\n\nSlovenia’s largest waterfall,\n\nBoka\n\n. You can stop for a minute and stand in awe of this pearl of nature. As you continue your journey downriver, you’ll pass some rapids where kayakers and rafters love to challenge the river’s strength. The surroundings start slowly transitioning from the rugged mountains of the Julian Alps to the\n\npre-alpine hills\n\nof the northern Primorska region. You’ll finish the day in Kobarid, a town steeped in World War I history, where the\n\nKobarid Museum\n\nnarrates the poignant tales of the Isonzo Front.\n\nHiking\n\n22 km and 425 m of elevation gain / 655 m of elevation loss\n\nAccommodation\n\nB&B in Kobarid\n\n×\n\nDay 5: Kobarid - Tolmin\n\nAnother long stage follows today. Journeying from Kobarid, you’ll traverse fairy-like forests and age-old, moss-draped stone structures, reaching the historic\n\nChurch of St. Lawrence\n\n, a muse to the poet Simon Gregorčič, who immortalized the\n\nSoča River\n\nin his writings. The path will lead you through quaint villages beneath the southern slopes of the Julian Alps, reigned over by the magnificent\n\nMt. Krn\n\n. After reaching Tolmin, you can explore the famous\n\nTolmin Gorges\n\n, cut into sheer rock by the flowing water throughout centuries.\n\nHiking\n\n16.5 km and 150 m of elevation gain / 200 m of elevation loss\n\nAccommodation\n\nB&B in Tolmin\n\n×\n\nDay 6: Tolmin - Lake Bohinj\n\nThere’s a long day ahead of you today. First, you’ll follow the Soča River from Tolmin to\n\nMost na Soči\n\n, where you’ll finally leave Soča Valley behind and\n\nboard a train\n\nfor a 40-minute ride through a tunnel to\n\nBohinjska Bistrica\n\n. After getting off the train, you’ll steer towards\n\nLake Bohinj\n\n, passing through the lower Bohinj valley through quaint hamlets with\n\nviews of Mt. Triglav\n\nopening up from time to time. Once you reach the shores of Lake Bohinj, you’ll follow the coast to\n\nStara Fužina\n\n, one of the villages by the lake, where you’ll find your hotel.\n\nHiking\n\n7 km and 60 m of elevation gain / 75 m of elevation loss & 8 km and 85 m of elevation gain / 60 m of elevation loss\n\nAccommodation\n\nHotel or B&B in Stara Fužina\n\n×\n\nDay 7: Lake Bohinj - Pokljuka Plateau\n\nLeaving Lake Bohinj behind, you’ll wander through\n\nquaint Alpine villages\n\nwhere traditional farming life is still prevalent. The Juliana trail then starts slowly climbing to the vast\n\nPokljuka Plateau\n\n. There’ll be multiple chances to enjoy spectacular\n\nviews of Lake Bohinj\n\nbehind you before you reach the\n\nGoreljek peat bog\n\n. Following the educational route to learn about the fascinating peat mosses and carnivorous plants, you’ll reach your destination for the night,\n\nSport Hotel Goreljek\n\n.\n\nHiking\n\n19.8 km and 900 m of elevation gain / 200 m of elevation loss\n\nAccommodation\n\nSport Hotel Goreljek\n\n×\n\nDay 8: Pokljuka Plateau - Lake Bled\n\nYour final day on the trail begins in the\n\nwoods of Pokljuka\n\n, where you’ll follow the path leading you through\n\nPokljuka Gorge\n\n. The descent has some steep and narrow parts where caution is advised. It will take you to the small villages of\n\nZgornje and Spodnje Gorje\n\n, slowly easing you into the more bustling area surrounding\n\nLake Bled\n\n. The first views of this Slovenian pearl are something to memorize forever. Upon reaching it, you’ll follow its\n\nnorthern shore\n\nand conclude your journey in the center of the Bled town.\n\nHiking\n\n20 km and 160 m of elevation gain / 940 m of elevation loss\n\nAccommodation\n\nHotel in Bled\n\n×\n\nDay 9: Lake Bled and departure\n\nThere’s no better place to reflect on the journey behind than the magical Bled. The day is yours to enjoy, and you can spend it exploring the surroundings of the lake, taking a “\n\npletna” boat ride\n\nto the lake’s island, buying yourselves some\n\nsouvenirs\n\n, or trying a piece of the famous cream cake,\n\nKremšnita\n\n. There are also tons of opportunities for gastronomical exploration, be it the wonderful\n\nlocal restaurants\n\nor booking a\n\nwine-tasting experience\n\n. After that, you’ll head to the airport. We can also\n\narrange a transfer\n\nfor you to ease you on your way.\n\n×"
}