{
  "id": "huttohuthikingslovenia.com_tours_triglav-ski-touring-traverse__chunk_1",
  "title": "Triglav Ski Touring Traverse - Part 1",
  "content": "The\n\nTriglav ski touring traverse\n\nis the ultimate way of experiencing the winter in the Slovenian Alps. Also called the Triglav “Magistrala”, it is\n\nthe only true multi-day ski tour in Slovenia and a must-do for every ski tourer\n\nwho finds himself in the Triglav National Park.\n\nIn three days, it takes you from\n\nVogel ski resort\n\nto\n\nKomna plateau\n\n, through the\n\nTriglav Lakes Valley\n\n, across Hribarice mountain pass and down to Velska dolina and the Krma valley. Optionally, the\n\ntour can be extended by one day with a demanding climb of Triglav\n\n, the highest summit in the Julian Alps. It is a Slovenian mini version of the famous Haute Route from Chamonix to Zermatt, much more peaceful, and just as beautiful.\n\nIt is a terrain full of ups and downs, none too steep, so a perfect way of enjoying the amazing scenery, while also putting your skiing skills to the test – it is a tour\n\nsuitable for most ski tourers\n\n, that are confident in\n\nskiing independently\n\nand are in solid fitness condition – the backpack on the tour is a bit on the heavy side, because of the\n\nadventurous nature and remoteness of the tour\n\n. The tour takes you into the winter paradise of the Julian Alps, across plateaus, valleys and snowy peaks. The terrain snow made almost unreachable by foot, suddenly becomes your ski playground.\n\nWe will spend our first night in a well-stacked mountain hut on the\n\nKomna Plateau\n\n, while our second night is spent in an\n\nauthentic mountain bivouac,\n\nwhere we will\n\nrely on our own supplies.\n\nSpending three days in the majestic scenery of snowy mountains that few people ever see in their entire lives will be an unforgettable and beautiful journey. Enjoy the wilderness of the Julian Alps with our most experienced guides and see what ski touring in Slovenia has to offer."
}