{
  "id": "huttohuthikingslovenia.com_tours_pokljuka-family-hut-to-hut-hike__chunk_2",
  "title": "Pokljuka Family Hut to Hut Hike - Part 2",
  "content": "Day 1: Goreljek to Blejska Hut\n\nYour family adventure begins in a small settlement on\n\nPokljuka Plateau\n\n, Goreljek. You will start hiking through the lush forests of the plateau until you reach the picturesque\n\nZajavornik\n\nmountain pasture, where you can stop and try their homemade sour milk.\n\nWhen you are well-rested and ready to continue, the path will take you toward the\n\nLipanca\n\nmountain pasture. It is there that you will find the Blejska Hut, where you will spend the night.\n\nHiking\n\n6 km (3,8 mi), 420 vertical meters up (1380 feet), 50 meters down (165 feet)\n\nAccommodation\n\nBlejska koča na Lipanci\n\n×\n\nDay 2: Blejska Hut to Uskovnica Hut\n\nYou will start the day with a short climb to the panoramic ridge above the hut that steeply falls to the\n\nKrma valley\n\non the other side. As you make your way along the ridge, you will get to delight in the magnificent views of\n\nMt. Triglav\n\nacross the valley.\n\nAfter overcoming a slightly treacherous descent from Srenjski preval, you will cross the charming\n\nKonjščica\n\nmountain pasture and continue along the undulating path toward the Uskovnica Hut.\n\nHiking\n\n11 km (6,8 mi), 360 vertical meters up (1180 feet), 840 meters down (2760 feet)\n\nAccommodation\n\nPlaninska koča na Uskovnici\n\n×\n\nDay 3: Uskovnica Hut to Goreljek\n\nThe last day will see you conclude your circle around Pokljuka Plateau as you turn back toward\n\nGoreljek\n\n. The up-and-down path will lead you across the\n\nZajamniki\n\nmountain pasture, one of the most picture-perfect locations in Slovenia, before you reach the finishing point of your hike.\n\nHiking\n\n10 km (6,2 mi), 300 vertical meters up (985 feet), 200 meters down (660 feet)\n\n×\n\nExtra days: Bled or Bohinj\n\nIf you wish to add a stage before or after the outlined hike, you can begin your journey at\n\nBled\n\nor Bohinj and hike to Goreljek, where you spend the first night. Similarly, you can spend another night at Goreljek after the hike and descend to Bled or\n\nBohinj\n\nthe next day.\n\n×"
}