{
  "id": "huttohuthikingslovenia.com_tours_triglav-hut-to-hut__chunk_1",
  "title": "Triglav 3-day Hut to Hut - Part 1",
  "content": "This tour gives you the chance to see the best of the\n\nbreathtaking Julian Alps\n\n, and also climb Slovenia’s highest mountain,\n\nthe epic Mount Triglav\n\n. Find out for yourself why this mountain is deemed the symbol of Slovenia and the most popular hike in the country. It is even said that you only become a ‘true Slovenian’ once you’ve conquered its peak.\n\nBy extending the standard\n\ntwo-day Triglav climb\n\nfor just a day, you will get to explore the\n\npristine high mountain lakes\n\nof the\n\nTriglav Lakes Valley\n\n, also known as the Seven Lakes Valley, and its mesmerising surrounding mountains.\n\nWe will also hike across\n\nmountain pastures\n\nand pass\n\ntraditional shepherd’s huts\n\nthat are still used by shepherd’s in some cases. The mountains are therefore populated with herds of sheep and cows, as well as its autochthonous inhabitants – the chamois, ibex, and marmot.\n\nOn the first day, we will reach the\n\nPlanika Lodge\n\nbelow the Triglav summit,\n\nascend Triglav on the second day\n\n, and afterwards marvel at the Triglav lakes as we hike to our lodging for the night. On the last day we will stretch our legs with an easier hike and finish our tour in Bohinj.\n\nTriglav is a climb that can be done by almost anyone who is\n\nreasonably fit, has basic hiking experiences, and doesn’t have vertigo or a fear of heights\n\n. Still, at 2864 metres of altitude, Triglav is not to be underestimated. While most of the hike doesn’t require technical skills, the\n\nsummit push is very exposed and steep\n\n, where most will feel more comfortable\n\nwith protection\n\n. It’s all well worth the view at the top though, and a picture next to the famous Aljaž Tower will definitely become one of your favourites.\n\nAmazing views and exciting hikes aren’t the only things that make this tour a truly\n\ngenuine hiking experience\n\n. We will actually spend a full three days in the mountains,\n\nsleeping and eating in mountain huts\n\n, enjoying the alpine vibe and meeting other mountain lovers. It doesn’t get more authentic than that!\n\nNOTE: if part of the group would rather skip the Triglav climb, and stick to less technical terrain, we can adapt the tour so that only those who want to ascend the peak do so, and then regroup with the rest later."
}