{
  "id": "huttohuthikingslovenia.com_triglav-national-park__chunk_1",
  "title": "Triglav National Park - Part 1",
  "content": "Everything about Slovenia's Triglav National Park in one place.\n\nNamed after our highest mountain, Triglav National Park spans over 840 km2, which translates to 4% of Slovenia’s territory and most of the country’s Julian Alps. Our only national park was established in 1981, but the park’s\nbeautiful mountainous landscape with its sharp peaks, pristine lakes, high karst plateaus, glacier-made valleys and crystal-clear waters\nis over 200 million years old and home to over 7,000 animal species and 1,600 types of plants. TNP is\nSlovenia’s most popular destination\nfor locals and tourists from all over the world, with its natural beauty and impressive history making it one worth visiting.\nAmong the many of the Park’s highlights, you can find the Lake Bohinj, Triglav Lakes Valley, Peričnik Waterfall, Pokljuka Plateau, Soča River, Tolmin Gorge, an endless amount of peaks with scenic views all around the park.\nTriglav north face as viewed form Vrata valley\nThe Triglav National park is a place where you can find many authentic alpine villages, that offer delicious cuisine made from local produce. Towns like Bovec, Kranjska Gora and Kobarid supply sports activities, excellent accommodations (hotels, camps, glamping, mountain huts), restaurants and museums. There is always something interesting to discover in and around these places, nestled within surreal surroundings.\nThe Beginnings\nAlthough the name has been first used in 1926, its history stretches back to the beginning of the 20th century.\nIn year 1906, Slovenian all-around scientist Albin Belar proposed a protected area of the Triglav Lakes Valley\n, but the idea for a first park of such kind in Europe was turned down.\nThe idea didn’t reemerge until after the 1st World War, when the strategic basis for this piece of the land, titled the Memorandum was submitted to the Provincial Government of Slovenia in 1920.\nThe idea was finally\nimplemented in 1924, when the Alpine Conservation Park was founded\n, which protected the area around the Seven Lakes Valley. It was made possible by an initiative by the Nature Protection Section of the Slovene Museum Society together with the Slovene Mountaineering Society for a twenty-year lease taken on the Triglav Lakes Valley area.\nThe name “Triglav National Park” was used soon after in 1926, by a botanist and a plant geneticist Fran Jesenko.\nTrenta valley\nIn 1961, the protection act was renewed and the name of the park was changed to Triglav National Park.\nEven though it held the name of our highest mountain, the park only protected the wider area of the Triglav Lakes Valley, from Kanjavec peak to Savica Waterfall.\nFinally, in 1981, the Law of the Triglav National Park was passed and its present borders, containing most of the Julian Alps, were outlined.\nFrom the 20 square kilometres protected at first, it enlarged to an area of 840 square kilometres it covers nowadays.\nTNP’s vision mission\nThe priority objectives of the park are\nconservation of ecosystems and natural processes, natural assets, diversity of habitats, plant and animal species, landscape quality and landscape diversity.\nIn the park’s area which is settled, the main focus is to\nsafeguard the\ncultural heritage and quality of land\n, which arose from the harmony between man and nature.\nNature’s wellbeing is our responsibility\nThe Park wants to provide you with a rich experience of its natural beauty, but remember – we are all just guests of this highly sensitive natural environment, so when we pay it a visit, we must take on the responsibility to help maintain its state of preservation.\nHere are the most important rules of conduct in the Park:\nPark your vehicle in one of the many designated car parks.\nStay on the marked trails and keep your noise levels down to not disturb the animals.\nDogs must be kept on a leash.\nRespect the flora and fauna. You can experience TNP’s richness up-close, but make sure your presence does not disturb their lives.\nObserve a sky full of stars from benches outside mountain huts, lodges, shelters and bivouacs. Camping or bivouacking outside designated areas is forbidden.\nTake only memories and leave only footprints behind – do not pick flowers and take the trash with you\nA Paradise for Outdoor Enthusiasts\nWith its towering mountains, scenic valleys, pristine waters, peaceful forests and rich cultural heritage, the Triglav National Park is a wonderland of outdoor activities and must-see places. The most popular of those activities is hiking, which is presented in more detail in “\nHiking in Triglav National Park\n”.\nStand up paddling on Bohinj Lake\nWater Activities in Triglav National Park\nThe Park is home to more than 250 springs of various sizes, numerous alpine lakes, Slovenia’s largest natural lake Bohinj, a broad network of rivers and streams, wetlands and bogs. It’s also where two important European rivers emerge,\nthe\nSava and the Soča River\n.\nThese bodies of water make the park a perfect spot for many kinds of recreational activities in the water like\nswimming, kayaking, rafting, canyoning, fishing or more\n. But remember, swimming in the high-altitude lakes like the ones in Triglav Lakes Valley is strictly forbidden since it deteriorates their biosphere.\nRock Climbing in Triglav National Park\nThe Park is home to numerous natural climbing areas of various difficulties. For those that still getting used to rock climbing, one of the options would be\nPeč, near lake Bohinj\n, which has 56 routes, suitable for people less and more familiar with the sport. Another option is a\nwall in Trenta valley\n, rising next to the Soča River. It has two boulders equipped with 27 directions for both beginners and experienced climbers.\nFor those wanting to test themselves more, the\nBlažec rock wall\noffers up to 80 meters long directions with multiple pitches and a view of the Vrata Valley. For climbing at a higher altitude, drive up to the 1611 meters high\nVršič pass\nand try out some of the 35 routes they have there, which are between 18 and 100 meters long.\nWinter Sports in Triglav National Park\nDuring the winter season,\nTNP is transformed into a snowy paradise straight out of a fairy-tale.\nSnowshoeing in the Tamar Valley or cross-country skiing along the pastures of Pokljuka Plateau is a must. The winter tourism hub of Kranjska Gora offers diverse alpine skiing opportunities and the high-altitude Vogel ski resort can be one of your only chances to try skiing above the clouds. Just one step from Vogel, the Julian Alps offer endless options for ski-touring."
}