{
  "id": "huttohuthikingslovenia.com_tours_triglav-hut-to-hut__chunk_2",
  "title": "Triglav 3-day Hut to Hut - Part 2",
  "content": "Day 1: Approach to Planika Hut\n\nAfter we pick you up we will drive to Bohinj and start our hike. Our ascend into the mountains will start with\n\ncrossing beautiful Alpine mountain pastures\n\nand seeing where the shepherds used to spend their summers, earning their living by herding sheep and cows. Some of this tradition is still preserved, and the proof lies in the sheep and cows that will greet us on our way.\n\nOnce we reach the Vodnik lodge we will stop to rest for a bit. Then we will climb up the mountainside and arrive at our destination, the\n\nPlanika Lodge just below Triglav,\n\nwhere we will have a hearty Slovenian dish for dinner, and get some sleep.\n\nHiking\n\n12.8 km (8 mi) · +1600 m / -400 m (+5260 ft / -1300 ft)\n\nAccommodation\n\nDom Planika\n\n×\n\nDay 2: Triglav Summit\n\nIn the early hours of the day we will have breakfast, and then continue our ascent on Triglav that soon becomes technically challenging.\n\nThe steel cable that is set up here for protection will help you climb through these parts, along with careful assistance from your guide.\n\nThe path is steep and exposed and continues on a narrow ridge towards the summit.\n\nGetting off the mountain is just as demanding. We will walk across the Triglav škrbina to a plateau on the west. We will descend down to the Dolič Mountain Hut and enjoy an authentic cooked meal before continuing to the Triglav Lakes Valley where we will spend the night.\n\nHiking\n\n14 km (8.7 mi) · +800 m / -1450 m (+2600 ft / -4750 ft)\n\nAccommodation\n\nKoča pri Triglavskih Jezerih\n\n×\n\nDay 3: The Seven Lakes Valley\n\nWe will start our final day by tackling the steep hillside to\n\nMala Tičarica for the view\n\n. If we feel like taking it a bit easier, we will just pass it across the slightly up and down terrain to reach the Ovčarija mountain pasture, and then the Dedno polje mountain pasture. Here we will have the\n\noption to pay a visit to a local cheese-maker, who still produces cheese the traditional way up on the pasture\n\n.\n\nWe will slowly hike down to our car, and drive you back to your hotel, with the option of stopping for a\n\nswim in Lake Bohinj.\n\nHiking\n\n9 km (5.6 mi) · +340 m / -860 m (+1110 ft / -2800 ft)\n\n×"
}