{
  "id": "text_chunk_2",
  "title": "Additional Information - Part 2",
  "content": "Lunch options\nLunch options depend on the day's route and the availability of huts along the way. You can either stop at a hut for a warm meal or take a packed lunch from the hut where you stayed overnight. If there are huts conveniently located along your route, we recommend stopping for a fresh meal, but if no suitable options are available, a takeaway packed lunch is the best choice. To make planning easier, we specify in the handout whether you should expect a hut for lunch or if it's better to bring food with you for the day.\n\nBad weather or conditions\nLight Rain\nLight rain is not a problem and is a common occurrence in the mountains. A good waterproof jacket and backpack cover will keep you dry, and the hike can continue as planned.\nAfternoon Showers & Storms\nDuring summer, afternoon thunderstorms are common in the Julian Alps. To avoid them, it’s best to start early in the morning and reach the hut before storms typically develop.\nSevere Weather Forecast\nIf severe weather (such as prolonged heavy rain, strong winds, or storms) is forecasted, we will be in touch with you. If possible, we will try to adjust your reservations by shifting your hike a few days earlier or later, depending on hut availability and your schedule.\nTour Cancellation Due to Unsafe Conditions\nIf the weather or trail conditions make the hike unsafe, and there is no viable alternative, we will cancel the tour and issue a full refund. Your safety is our top priority.\n\nRefund and Cancellation policy\nGeneral Terms of Cancellation\nThe following cancellation fees apply based on the time of cancellation and the specific category of the Client's booking.\n\nThe refunds are calculated based on the full trip cost, not on your deposit amount. Trip cost includes all payments made by the client to us, or any outstanding payments due before the start of the tour or activity, excluding booking fees and Flexibility Level costs.\nFull-day tours without accommodation:\n100% of the trip costs will be refunded for cancellations up to 7 days before departure.\n50% of the trip costs will be refunded for cancellations between 3-7 days before departure.\nNone (0%) of the trip costs will be refunded for cancellation on less than 3 days notice before the departure or no-show.\nMulti-day tours:\n70% of the trip costs will be refunded for cancellations up to 60 days before departure.\n25% of the trip costs will be refunded for cancellations between 31-60 days before departure.\nNone (0%) of the trip costs will be refunded for cancellation on less than 30 days notice before the departure or no-show.\nBefore submitting your order, you have the opportunity to review all details of your purchase (products, quantities, prices, addresses) and correct them if necessary. You can do this in the check out process while reviewing order summary.\nImportant Note: Refund Limitations\nRefunds cannot exceed the amount you have paid at the time of cancellation, and any outstanding balance owed to us is also accounted for. If you owe any remaining balance, it will be deducted from your refund.\n\nFor example, if you have only paid a 30% deposit and canceled 65 days before departure, you will not receive a refund, as 70% of the trip costs were still outstanding. If you paid the full amount, you would get refunded 70%.\nFlexibility Levels\nThe Client can choose between different Flexibility Levels upon booking an activity or package. If the Client chooses the Standard Flexibility (free of additional surcharge), the cancellation terms are as stated under the 'General Terms of Cancellation' section of our Terms of Service.\n\nIf the Client chooses and purchases a Flexibility Level other than the Standard Flexibility, the terms of cancellation change according to the Flexibility level chosen.\n\nAll of the pricings for our Flexibility Levels are based on the price of the package or activity per person for which the Flexibility Level is chosen.\n\nNo matter which option the Client chooses, the Company does not refund Flexibility Levels costs and booking fees.\n\nThese are the cancellation terms and pricing for our Flexibility Levels:\nBasic Flexibility\n100% of the trip costs will be refunded for cancellations up to 60 days before departure.\n25% of the trip costs will be refunded for cancellations between 31-60 days before departure.\nNone (0%) of the trip costs will be refunded for cancellation on less than 30 days notice before the departure or no-show\n\nUp to 200€ / price / person: 19€/person\n200-500€ / price / person: 35€/person\n500-1000€ / price / person: 75€/person\n1000-2000€ / price / person: 150€/person\n2000-3500€ / price / person: 275€/person\n3500-5000€ / price / person: 425€/person\n5000-7500€ / price / person: 675€/person\n7500€ and up / price / person: 750€/person\n\nEnhanced Flexibility\n100% of the trip costs will be refunded for cancellations up to 30 days before departure.\nNone (0%) of the trip costs will be refunded for cancellation on less than 30 days notice before the departure or no-show\n\nUp to 200€ / price / person: 30€/person\n200-500€ / price / person: 75€/person\n500-1000€ / price / person: 150€/person\n1000-2000€ / price / person: 300€/person\n2000-3500€ / price / person: 525€/person\n3500-5000€ / price / person: 750€/person\n5000-7500€ / price / person: 1125€/person\n7500€ and up / price / person: 1500€/person\n\nMaximum Flexibility\n100% of the trip costs will be refunded for cancellations up to 7 days before departure.\nNone (0%) of the trip costs will be refunded for cancellation on less than 7 days notice before the departure or no-show\n\nUp to 200€ / price / person: 39€/person\n200-500€ / price / person: 99€/person\n500-1000€ / price / person: 199€/person\n1000-2000€ / price / person: 399€/person\n2000-3500€ / price / person: 699€/person\n3500-5000€ / price / person: 999€/person\n5000-7500€ / price / person: 1499€/person\n7500€ and up / price / person: 1999€/person\n\nYou can read more details about our terms and conditions here: https://huttohuthikingslovenia.com/terms-of-service/\n\nWhat Does the Handout Include?\nWhen you book a hut-to-hut hiking tour, you will receive a detailed handout to help you navigate and make the most of your adventure. The handout includes:\nGPS Navigation – Easy & Reliable\nTo ensure a smooth and worry-free hiking experience, we provide detailed GPS navigation that you can use directly on your smartphone with an easy-to-use app."
}